/* errAuthorizationInvalidSet */
"-60001" = "Godkjenningsrettighetene er ugyldige.";

/* errAuthorizationInvalidRef */
"-60002" = "Godkjenningsreferansen er ugyldig.";

/* errAuthorizationInvalidTag */
"-60003" = "Godkjenningskoden er ugyldig.";

/* errAuthorizationInvalidPointer */
"-60004" = "Den returnerte godkjenningen er ugyldig.";

/* errAuthorizationDenied */
"-60005" = "Godkjenningen ble avslått.";

/* errAuthorizationCanceled */
"-60006" = "Godkjenningen ble avbrutt av brukeren.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "Godkjeningen ble avslått siden ingen brukerhandlinger var mulig.";

/* errAuthorizationInternal */
"-60008" = "Kunne ikke hente godkjenning for denne handlingen.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Det er ikke tillatt å konvertere godkjenningen til et eksternt format.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Det er ikke tillatt å opprette godkjenningen fra et eksternt format.";

/* errAuthorizationInvalidFlags */
"-60011" = "Ett eller flere valgflagg er ugyldige for denne godkjenningshandlingen.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Det angitte programmet kunne ikke startes.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Det ble returnert en ugyldig status under utføringen av et verktøy med privilegier.";

/* errAuthorizationBadAddress */
"-60033" = "Den forespurte socketadressen er ugyldig (må være i området fra 0 til 1023).";

/* errSSLProtocol */
"-9800" = "SSL-protokollfeil";

/* errSSLNegotiation */
"-9801" = "Cipher Suite-forhandling mislyktes";

/* errSSLFatalAlert */
"-9802" = "Alvorlig feil";

/* errSSLWouldBlock */
"-9803" = "I/O ville blokkere (ikke fatalt)";

/* errSSLSessionNotFound */
"-9804" = "forsøk på å gjenoppta en ukjent økt";

/* errSSLClosedGraceful */
"-9805" = "tilkoblingen ble lukket";

/* errSSLClosedAbort */
"-9806" = "tilkoblingen ble lukket på grunn av en feil";

/* errSSLXCertChainInvalid */
"-9807" = "ugyldig sertifikatkjede";

/* errSSLBadCert */
"-9808" = "ugyldig sertifikatformat";

/* errSSLCrypto */
"-9809" = "underliggende kryptografisk feil";

/* errSSLInternal */
"-9810" = "Intern feil";

/* errSSLModuleAttach */
"-9811" = "modultilkobling mislyktes";

/* errSSLUnknownRootCert */
"-9812" = "gyldig sertifikatkjede, rot uten tillit";

/* errSSLNoRootCert */
"-9813" = "sertifikatkjede ikke verifisert av rot";

/* errSSLCertExpired */
"-9814" = "kjeden har et utløpt sertifikat";

/* errSSLCertNotYetValid */
"-9815" = "kjeden har et sertifikat som ikke er gyldig ennå";

/* errSSLClosedNoNotify */
"-9816" = "tjeneren lukket økten uten melding";

/* errSSLBufferOverflow */
"-9817" = "utilstrekkelig buffer til rådighet";

/* errSSLBadCipherSuite */
"-9818" = "ugyldig SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "uventet melding mottatt";

/* errSSLPeerBadRecordMac */
"-9820" = "ugyldig MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "dekryptering mislyktes";

/* errSSLPeerRecordOverflow */
"-9822" = "oppføringsoverflyt";

/* errSSLPeerDecompressFail */
"-9823" = "dekomprimering mislyktes";

/* errSSLPeerHandshakeFail */
"-9824" = "handshake mislyktes";

/* errSSLPeerBadCert */
"-9825" = "div. ugyldig sertifikat";

/* errSSLPeerUnsupportedCert */
"-9826" = "ugyldig sertifikatformat som ikke støttes";

/* errSSLPeerCertRevoked */
"-9827" = "sertifikat tilbakekalt";

/* errSSLPeerCertExpired */
"-9828" = "sertifikat utløpt";

/* errSSLPeerCertUnknown */
"-9829" = "ukjent sertifikat";

/* errSSLIllegalParam */
"-9830" = "ulovlig parameter";

/* errSSLPeerUnknownCA */
"-9831" = "ukjent sertifikatautoritet";

/* errSSLPeerAccessDenied */
"-9832" = "tilgang ikke tillatt";

/* errSSLPeerDecodeError */
"-9833" = "dekodingsfeil";

/* errSSLPeerDecryptError */
"-9834" = "dekrypteringsfeil";

/* errSSLPeerExportRestriction */
"-9835" = "eksportrestriksjon";

/* errSSLPeerProtocolVersion */
"-9836" = "ugyldig protokollversjon";

/* errSSLPeerInsufficientSecurity */
"-9837" = "utilstrekkelig sikkerhet";

/* errSSLPeerInternalError */
"-9838" = "intern feil";

/* errSSLPeerUserCancelled */
"-9839" = "bruker avbrøt";

/* errSSLPeerNoRenegotiation */
"-9840" = "ingen gjenforhandling tillatt";

/* errSSLServerAuthCompleted */
"-9841" = "tjenersertifikat er gyldig eller (hvis verifisering er deaktivert) ble ignorert";

/* errSSLClientCertRequested */
"-9842" = "tjener har bedt om et klientsertifikat";

/* errSSLHostNameMismatch */
"-9843" = "vertsnavn stemmer ikke overens";

/* errSSLConnectionRefused */
"-9844" = "annen maskin avbrøt forbindelsen før respons";

/* errSSLDecryptionFail */
"-9845" = "dekrypteringsfeil";

/* errSSLBadRecordMac */
"-9846" = "ugyldig MAC";

/* errSSLRecordOverflow */
"-9847" = "oppføringsoverflyt";

/* errSSLBadConfiguration */
"-9848" = "konfigureringsfeil";

/* errSecSuccess */
"0" = "Ingen feil.";

/* errSecUnimplemented */
"-4" = "Funksjonen eller handlingen er ikke implementert.";

/* errSecParam */
"-50" = "Én eller flere parametre som har blitt sendt til en funksjon, er ikke gyldige.";

/* errSecAllocate */
"-108" = "Kunne ikke tildele hukommelse.";

/* errSecNotAvailable */
"-25291" = "Ingen nøkkelring er tilgjengelig. Det er mulig at du må starte maskinen på nytt.";

/* errSecReadOnly */
"-25292" = "Denne nøkkelringen kan ikke endres.";

/* errSecAuthFailed */
"-25293" = "Brukernavnet eller passordfrasen du oppga, er ikke riktig.";

/* errSecNoSuchKeychain */
"-25294" = "Den angitte nøkkelringen ble ikke funnet.";

/* errSecInvalidKeychain */
"-25295" = "Den angitte nøkkelringen er ikke en gyldig nøkkelringfil.";

/* errSecDuplicateKeychain */
"-25296" = "Det finnes allerede en nøkkelring med dette navnet.";

/* errSecDuplicateCallback */
"-25297" = "Den angitte gjenkallingsfunksjonen er allerede installert.";

/* errSecInvalidCallback */
"-25298" = "Den angitte gjenkallingsfunksjonen er ikke gyldig.";

/* errSecDuplicateItem */
"-25299" = "Det angitte objektet finnes allerede på nøkkelringen.";

/* errSecItemNotFound */
"-25300" = "Det angitte objektet ble ikke funnet på nøkkelringen.";

/* errSecBufferTooSmall */
"-25301" = "Det er ikke nok hukommelse tilgjengelig til å bruke det angitte objektet.";

/* errSecDataTooLarge */
"-25302" = "Dette objektet inneholder for mye informasjon eller informasjon i et format som ikke kan vises.";

/* errSecNoSuchAttr */
"-25303" = "Det angitte attributtet finnes ikke.";

/* errSecInvalidItemRef */
"-25304" = "Det angitte objektet er ikke lenger gyldig. Det kan ha blitt slettet fra nøkkelringen.";

/* errSecInvalidSearchRef */
"-25305" = "Kan ikke søke i denne nøkkelringen.";

/* errSecNoSuchClass */
"-25306" = "Det angitte objektet ser ikke ut til å være et gyldig nøkkelringobjekt.";

/* errSecNoDefaultKeychain */
"-25307" = "Finner ingen standardnøkkelring.";

/* errSecInteractionNotAllowed */
"-25308" = "Brukerhandlinger er ikke tillatt.";

/* errSecReadOnlyAttr */
"-25309" = "Det angitte attributtet kunne ikke endres.";

/* errSecWrongSecVersion */
"-25310" = "Denne nøkkelringen ble opprettet med en annen versjon av systemprogramvaren og kan ikke åpnes.";

/* errSecKeySizeNotAllowed */
"-25311" = "Dette objektet angir en nøkkelstørrelse som er for stor.";

/* errSecNoStorageModule */
"-25312" = "En nødvendig komponent (datalagringsmodul) kunne ikke lastes inn. Det er mulig at du må starte maskinen på nytt.";

/* errSecNoCertificateModule */
"-25313" = "En nødvendig komponent (sertifikatmodul) kunne ikke lastes inn. Det er mulig at du må starte maskinen på nytt.";

/* errSecNoPolicyModule */
"-25314" = "En nødvendig komponent (kriteriemodul) kunne ikke lastes inn. Det er mulig at du må starte maskinen på nytt.";

/* errSecInteractionRequired */
"-25315" = "En brukerhandling er nødvendig, men er for øyeblikket ikke tillatt.";

/* errSecDataNotAvailable */
"-25316" = "Innholdet i dette objektet kan ikke hentes fram.";

/* errSecDataNotModifiable */
"-25317" = "Innholdet i dette objektet kan ikke endres.";

/* errSecCreateChainFailed */
"-25318" = "Ett eller flere sertifikater som er nødvendig for godkjenning av dette sertifikatet, ble ikke funnet.";

/* errSecInvalidPrefsDomain */
"-25319" = "Det angitte valgdomenet er ikke gyldig.";

/* errSecACLNotSimple */
"-25240" = "Den angitte tilgangskontrollisten er ikke i standardform (enkel).";

/* errSecPolicyNotFound */
"-25241" = "De angitte kriteriene ble ikke funnet.";

/* errSecInvalidTrustSetting */
"-25242" = "Den angitte tillitsinnstillingen er ikke gyldig.";

/* errSecNoAccessForItem */
"-25243" = "Det angitte objektet har ikke tilgangskontroll.";

/* errSecInvalidOwnerEdit */
"-25244" = "Ugyldig forsøk på å endre eier for dette objektet.";

/* errSecTrustNotAvailable */
"-25245" = "Ingen tillitsresultater er tilgjengelig.";

/* errSecUnsupportedFormat */
"-25256" = "Import-/eksport-formatet støttes ikke.";

/* errSecUnknownFormat */
"-25257" = "Ukjent importformat.";

/* errSecKeyIsSensitive */
"-25258" = "Nøkkelmateriale må pakkes inn før eksport.";

/* errSecMultiplePrivKeys */
"-25259" = "Det ble gjort et forsøk på å importere flere private nøkler.";

/* errSecPassphraseRequired */
"-25260" = "Det er nødvendig med en passordfrase for import/eksport.";

/* errSecInvalidPasswordRef */
"-25261" = "Passordreferansen var ugyldig.";

/* errSecInvalidTrustSettings */
"-25262" = "Oppføringen for tillitsinnstillinger ble ødelagt.";

/* errSecNoTrustSettings */
"-25263" = "Ingen tillitsinnstillinger ble funnet.";

/* errSecPkcs12VerifyFailure */
"-25264" = "MAC-verifisering mislyktes under PKCS12-import.";

/* errSecDecode */
"-26275" = "Kan ikke dekode data.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP Vector of Buffers-feilverdier.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP Cryptographic Context-feilverdier.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP Staged Cryptographic API-feilverdier.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Det ble gjort et forsøk på å bruke en felles nøkkel som er ufullstendig på grunn av * mangelen på algoritmespesifikke parametre.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "en kodesignaturmatch mislyktes";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Nøkkelen StartDate/EndDate er ugyldig";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Synkroniseringsfeilkoder for Nøkkelring";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2 padding-kontroll: rollback-angrep detektert";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "OpenParameters-argumentet som ble sendt til CSSM_DL_DbCreate eller CSSM_DL_DbOpen, var verken NULL eller en peker til en gyldig CSSM_APPLEDL_OPEN_PARAMETERS-struktur.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "en handling mislyktes fordi disken var full";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "en handling mislyktes fordi en diskkvote ble overskredet";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "en handling mislyktes fordi en fil var for stor";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "den interne informasjonen i en nøkkelringdatabase («blob») er ugyldig";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "den interne dataformatversjonen for en databases interne informasjon («blob») er ugyldig";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Feil vertsnavn";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Ikke-forstått tillegg med Kritisk-flagg satt til sann";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Basic Constraints-tillegg kreves ifølge kriteriene, men er ikke til stede";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Ugyldig BasicConstraints.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Ugyldig nøkkel-ID for autoritet ";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Ugyldig nøkkel-ID for bruker ";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Ugyldig Key Usage for kriteriene";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Ugyldig Extended Key Usage for kriteriene";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Ugyldig bruker/autoritet nøkkel-ID-kobling";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint overskredet";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Sertifikatgruppe avsluttet ved et rotsertifikat uten egenverifisering";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL utløpt/ikke gyldig ennå";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Finner ikke riktig CRL";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "Angitt CRL-tjener ikke tilgjengelig";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "uleselig CRL-distribusjonspunkt-URL";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Ukjent kritisk sertifikat/CRL-tillegg";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL ikke verifiserbar for anker eller rot";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL verifiserte til ikke-godkjent rot";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "Kriterieverifisering mislyktes for CRL";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "IssuingDistributionPoint-tilleggovertredelse";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Sertifikat ikke funnet hos angitt issuerAltName";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Ødelagt sertifikat mottatt fra angitt issuerAltName";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME-e-postadresse stemmer ikke overens";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Passende S/MIME ExtendedKeyUsage ble ikke funnet ";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME-nøkkelbrukinkompatibilitet";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, sertifikat med KeyUsage flagget !kritisk";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, leaf med tomt emnenavn og ingen e-postadresser * i SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, leaf med tomt emnenavn, SubjectAltName * ikke kritisk";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Riktig SSL ExtendedKeyUsage ikke funnet";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "uforståelig OCSP-svar";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "uforståelig OCSP-forespørsel";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP-tjeneste ikke tilgjengelig";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP-status: sertifikat ikke gjenkjent";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "opphevingssjekk ikke vellykket for alle sertifikater";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "generell nettverksfeil";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "OCSP-svar ikke verifiserbart for anker eller rot";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "OCSP-svar verifisert til uverifisert rot";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP-svarsignaturfeil";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Ingen signerer ble funnet for OCSP-svar";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP-responderstatus: forespørsel har feil format";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP-responderstatus: intern feil";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP-responderstatus: prøv senere";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP-responderstatus: signatur kreves";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP-responderstatus: uautorisert";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP-svar («nonce») passet ikke til forespørselen";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Ulovlig sertifikatkjedelengde for kodesignering";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Mangler Basic Constraints for kodesignering";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Ugyldig PathLengthConstraint for kodesignering";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Mangler ExtendedKeyUsage for kodesignering";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Kodesigneringssertifikat av utviklingstypen funnet";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Ulovlig sertifikatkjedelengde for ressurssignering";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "feil Extended Key Usage for ressurssignering";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Tillitsinnstilling: avvis";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "ugyldig, tomt SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "ukjent kritisk kvalifisert sertifikatutsagns-ID";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "sertifikatforespørsel lagt i kø";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "sertifikatforespørsel omdirigert";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "generell tjenerrapportert feil";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "tjenerrapportert parameterfeil";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "tjenerrapportert autoriseringsfeil";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "tjenerrapportert ikke implementert";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "tjenerrapportert ikke tilgjengelig";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "tjenerrapportert finnes allerede";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "tjenerrapportert tjenestefeil";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "forespørsel er allerede under behandling for angitt bruker";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "ingen forespørsel for angitt bruker er under behandling";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR kunne ikke verifisere";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "tjener rapporterte mislykket overensstemmelseskontroll";

/* errSecCSUnimplemented */
"-67072" = "uimplementert kodesigneringsfunksjon";

/* errSecCSInvalidObjectRef */
"-67071" = "ugyldig API-objektreferanse";

/* errSecCSInvalidFlags */
"-67070" = "ett eller flere ugyldige eller uhensiktsmessige API-flagg angitt";

/* errSecCSObjectRequired */
"-67069" = "et nødvendig pekerargument var NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "finner ikke kodeobjekt på disken";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "finner ikke gjester med dette attributtsettet";

/* errSecCSInvalidAttributeValues */
"-67066" = "oppgitte attributtverdier er ugyldige";

/* errSecCSNoSuchCode */
"-67065" = "verten har ingen gjester med de forespurte attributtene";

/* errSecCSMultipleGuests */
"-67064" = "verten har flere gjester med denne attributtverdien";

/* errSecCSGuestInvalid */
"-67063" = "kodeidentiteten har blitt gjort ugyldig";

/* errSecCSUnsigned */
"-67062" = "kodeobjektet er ikke signert";

/* errSecCSSignatureFailed */
"-67061" = "kode eller signatur har blitt endret";

/* errSecCSSignatureNotVerifiable */
"-67060" = "signaturen kan ikke leses, for eksempel på grunn av et filsystem som tilordner rot til en bruker uten rettigheter";

/* errSecCSSignatureUnsupported */
"-67059" = "signaturtypen eller -versjonen støttes ikke";

/* errSecCSBadDictionaryFormat */
"-67058" = "en nødvendig plist-fil eller ressurs har feil format";

/* errSecCSResourcesNotSealed */
"-67057" = "ressurser er ikke beseglet med signatur";

/* errSecCSResourcesNotFound */
"-67056" = "finner ikke beseglede ressurser i koden";

/* errSecCSResourcesInvalid */
"-67055" = "den forseglede ressursen mangler eller er ugyldig";

/* errSecCSBadResource */
"-67054" = "en forseglet ressurs mangler eller er ugyldig";

/* errSecCSResourceRulesInvalid */
"-67053" = "ugyldig ressursutvelgelsesregel/-regler";

/* errSecCSReqInvalid */
"-67052" = "ett eller flere ugyldige eller ødelagte kodekrav";

/* errSecCSReqUnsupported */
"-67051" = "ett eller flere av kodekravtypene eller -versjonene støttes ikke";

/* errSecCSReqFailed */
"-67050" = "oppfylte ikke kodekravet/kodekravene";

/* errSecCSBadObjectFormat */
"-67049" = "objektfilformatet er ugyldig eller feil";

/* errSecCSInternalError */
"-67048" = "internfeil i kodesigneringsundersystem";

/* errSecCSHostReject */
"-67047" = "kode avviste verten";

/* errSecCSNotAHost */
"-67046" = "denne koden er ikke en vert";

/* errSecCSSignatureInvalid */
"-67045" = "ugyldig format for signatur";

/* errSecCSHostProtocolRelativePath */
"-67044" = "brudd på vertsprotokoll – absolutt bane kreves for gjest";

/* errSecCSHostProtocolContradiction */
"-67043" = "brudd på vertsprotokoll – uforenlige vertsmoduser";

/* errSecCSHostProtocolDedicationError */
"-67042" = "brudd på vertsprotokoll – handlingen er ikke tillatt med/for en dedikert gjest";

/* errSecCSHostProtocolNotProxy */
"-67041" = "brudd på vertsprotokoll – proxyvertfunksjon ikke aktivert";

/* errSecCSHostProtocolStateError */
"-67040" = "brudd på vertsprotokoll – ugyldig forespørsel om endring av tilstand for gjest";

/* errSecCSHostProtocolUnrelated */
"-67039" = "brudd på vertsprotokoll – den gitte gjesten er ikke en gjest hos den gitte verten";

/* errSecCSInvalidOperation */
"-67038" = "den forespurte operasjonen er ikke gyldig";

/* errSecCSNotSupported */
"-67037" = "operasjonen støttes ikke for denne kodetypen";

/* errSecCSCMSTooLarge */
"-67036" = "signaturen er for stor til å integreres";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "brudd på vertsprotokoll – ugyldig gjeste-«hash»";

/* errSecCSStaticCodeChanged */
"-67034" = "programmet på disken er ikke det samme som programmet som brukes";

/* errSecCSSigDBDenied */
"-67033" = "tilgang til signaturdatabase avvist";

/* errSecCSSigDBAccess */
"-67032" = "får ikke tilgang til signaturdatabase";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "vert returnerte ugyldige eller inkonsekvente gjesteattributter";

/* errSecMisc_dskFulErr */
"-34" = "Disken er full.";

/* errSecMisc_nsvErr */
"-35" = "Disken ble ikke funnet. Den kan ha blitt matet ut.";

/* errSecMisc_bdNamErr */
"-37" = "Forsøkte å åpne en fil med et navn som inneholder et ulovlig tegn.";

/* errSecMisc_fnfErr */
"-43" = "Filen ble ikke funnet.";

/* errSecMisc_wPrErr */
"-44" = "Disken er skrivebeskyttet.";

/* errSecMisc_fLckdErr */
"-45" = "Filen er låst.";

/* errSecMisc_vLckdErr */
"-46" = "Volumet er låst.";

/* errSecMisc_fBsyErr */
"-47" = "Filen er opptatt. Det er mulig at den er i bruk av et annet program.";

/* errSecMisc_dupFNErr */
"-48" = "Det finnes allerede en fil med dette navnet.";

/* errSecMisc_opWrErr */
"-49" = "Filen er allerede åpen med skrivetilgang.";

/* errSecMisc_volOffLinErr */
"-53" = "Volumet er ikke lenger tilgjengelig. Det kan ha blitt matet ut.";

/* errSecMisc_permErr */
"-54" = "Filen kunne ikke åpnes. Det er mulig at den er i bruk av et annet program.";

/* errSecMisc_extFSErr */
"-58" = "Dette volumet ser ikke ut til å være kompatibelt.";

/* errSecMisc_wrPermErr */
"-61" = "Kunne ikke skrive til filen. Det er mulig at den er åpnet med utilstrekkelige tilgangsrettigheter.";

/* errSecMisc_offLinErr */
"-65" = "Lagringsenheten er ikke lenger tilgjengelig. Den kan ha blitt koblet fra eller matet ut.";

/* errSecMisc_dirNFErr */
"-120" = "Katalogen ble ikke funnet.";

/* errSecMisc_volGoneErr */
"-124" = "Tjenervolumet er ikke lenger tilgjengelig. Det kan ha blitt koblet fra.";

/* errSecMisc_userCanceledErr */
"-128" = "Handlingen ble avbrutt av brukeren.";

/* errSecMisc_resNotFound */
"-192" = "En nødvendig ressurs ble ikke funnet.";

/* errSecMisc_resFNotFound */
"-193" = "En nødvendig ressurs mangler eller er skadet.";

/* errSecMisc_icNoURLErr */
"-673" = "Den angitte plasseringen (URL) er av en ukjent type eller inneholder ikke nok informasjon.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Et hjelpeprogram for åpning av den angitte URLen ble ikke funnet.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "Plasseringen (URLen) for dette objektet mangler eller er feil formatert.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Tilgang til dette objektet ble avslått.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Godkjenningen mislyktes. Det er mulig at passordet til denne tjeneren er endret etter at det ble lagt til på nøkkelringen.";

